{
  "main": {
    "welcomeMessage":"Welcome!",
    "name":"Genesis Izaguirre",
    "description":"My name is Genesis Izaguirre, I'm a front-end developer and QA engineer based in Tegucigalpa, Honduras. I have developed many types of front-ends from well know Ecommerce platforms to fintech frameworks. I have also contributed to automatic and manual testing for platforms dedicated to cybersecurity",
    "image":"profilepic.jpg",
    "bio":"Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "genesisizaguirre17@gmail.com",
    "phone": "(504) 9928-6923",
    "github":"https://github.com/nordicgiant2/react-nice-resume",
    "project":"https://github.com/nordicgiant2/react-nice-resume",
    "address":{
      "street":"(Your Street)",
      "city":"(Your City)",
      "state":"(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"facebook",
        "url":"https://github.com/nordicgiant2/react-nice-resume",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/tim-baker-8420009a/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/tbaker_x",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/nordicgiant2/react-nice-resume",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here, you can see the level of proficiency and experience I possess in the following technologies.",
    "education":[
      {
        "school":"Universidad Nacional Autonoma de Honduras",
        "degree":"Systems Engineering",
        "honor": "Cum Laude",
        "graduated":"Sep 2021",
        "description":"During my studies, my focus was on web development, where I learned to use languages for frontend development such as JavaScript, CSS, and HTML, for both desktop and mobile applications, employing responsive design principles. I also utilized various frontend frameworks such as Angular and React, and for styling, I employed Bootstrap, Materialize, and Ant Design. In addition, I acquired proficiency in using the Node.js environment for backend development."
      }
    ],
    "work":[
      {
        "company":"Hello Iconic",
        "title":"Middle Front End Developer",
        "years":"Feb 2023 -  May 2023",
        "description":"Developed and maintained data-rich JavaScript/HTML/CSS applications designed for smooth user navigation, ensuring exceptional user experience. This involved integrating front-end and back-end services while collaborating closely with software engineers, product owners and designers to ensure optimal customer satisfaction within an agile and dynamic workflow. The project I was assigned to during this position is a product that offers pre-built, pre-tested fintech designs, components, integrations, and features. During this experience I used the reactJS framework along with redux for complex states, in addition to the use of tokens for customization directly from the designs in figma, handling all this work in versioning in the git and github tool."
      },
      {
        "company":"Hello Iconic",
        "title":"Middle Quality Assurance Engineer",
        "years":"Jul 2022 - Feb 2023",
        "description":"I developed automated test scripts to streamline repetitive software testing tasks, providing guidance to developers on performance and database issues. I effectively communicated technical information using clear terminology, conducted research on emerging testing methodologies and equipment, and offered recommendations to enhance testing procedures. Additionally, I conducted training sessions for quality assurance team members on automation programs and processes, and executed automated test suites to evaluate performance, functionality, and scalability. My collaboration with developers and project managers involved assessing program capabilities, features, and testing requirements to ensure comprehensive quality control. During this experience, I utilized webdriverIO, Cypress, and Appium frameworks as per project needs, and also crafted tests and set up backend monitoring using the Postman tool."
      },
      {
        "company":"Hello Iconic",
        "title":"Junior Quality Assurance Engineer",
        "years":"Dic 2020 - Jul 2022",
        "description":"I meticulously documented integration, functionality, and UI issues within the TestRails tool using Gherkin syntax, simultaneously providing clear improvement recommendations. I conducted software error assessments, compiling detailed bug reports that included information such as the error's environment, reproducibility steps, its impact on functionality, and priority level. Collaboration was pivotal as I closely collaborated with various departments to devise innovative solutions to functionality problems. Furthermore, I partnered with the leadership team to devise an automation strategy and execution plan. My efforts extended to optimizing test cases to ensure the highest success rates in manual software testing. To enhance my software knowledge, I actively participated in available training sessions. Additionally, I crafted effective test scripts for managing automated feature testing using webdriverIO exclusively, consistently meeting tight deadlines to meet client demands and adhere to project timelines."
      },
      {
        "company":"Premper Design",
        "title":"Front-End Web Developer",
        "years":"Sep 2020 - Nov 2020",
        "description":"I actively collaborated with stakeholders throughout the development process, ensuring alignment with creative proposals and adherence to design best practices. My responsibilities included gathering and addressing technical and design requirements, seamlessly integrating user interface elements to enhance the effectiveness of our dynamic e-commerce web presence. I also took charge of creating reusable content modules and developing prototypes to improve efficiency. Furthermore, I was committed to identifying and resolving website performance issues to enhance overall functionality. My coding skills in HTML, CSS, and JavaScript were instrumental in developing responsive web page features that contributed to the project's success. During this experience, I utilized the Angular framework in conjunction with the Bulma CSS framework."
      }
    ],
    "skills":[
      {
        "name":"ReactJs",
        "level":"85%"
      },
      {
        "name":"AngularJS",
        "level":"75%"
      },
      {
        "name":"Javascript",
        "level":"98%"
      },
      {
        "name":"TypeScript",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"95%"
      },
      {
        "name":"HTML",
        "level":"97%"
      },
      {
        "name":"WebdriverIO",
        "level":"80%"
      },
      {
        "name":"Cypress",
        "level":"70%"
      },
      {
        "name":"Appium",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"01.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"02.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"03.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"04.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"05.jpg",
        "url":"http://www.smirkspace.com"
      },
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"06.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"01.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"02.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"03.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"04.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"05.jpg",
        "url":"http://www.smirkspace.com"
      },
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"06.jpg",
        "url":"https://www.canadianwanderlust.com"
      }
    ]
  }
}
